# read design
read -sv xorwow.v
hierarchy -top xorwow

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty vsclib013.lib

# mapping logic to mycells.lib
abc -liberty vsclib013.lib
stat -liberty vsclib013.lib

flatten; ltp 

# Print some general statistics
stat

# cleanup
clean
